diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрПередачи") Тогда
		ПостроитьДиаграмму(Параметры.ПараметрПередачи);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не передан параметр построения диаграммы");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграмму(ПараметрПередачи)
	
	ТаблицаЗначенийСтрока = ЗначениеИзСтрокиВнутр(ПараметрПередачи);
	ХранилищеТаблицы = ВКМ_ПолезныеФункции.ДесериализацияXML(ТаблицаЗначенийСтрока);
	ТаблицаЗначений = ХранилищеТаблицы.Получить();
	ГрафикОтпусков.Очистить();
	
	ТаблицаЗначений.Сортировать("ДатаНачала");
	
	Серия = ГрафикОтпусков.Серии.Добавить();
	Серия.Текст = "Отпуск";
	Серия.Цвет = WebЦвета.СинеФиолетовый;
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник); // Родитель = "Демо"
		Точка.Текст = Строка(Строка.Сотрудник);
		Точка.Картинка = БиблиотекаКартинок.ПользовательБезФотографии;
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		Значение.Редактирование = Ложь;
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
